#!/bin/bash
###############################################################################
#    文件名  :    public.sh                                                   #
#    功  能  :    公共函数、参数定义程序                                      #
#    编  写  :    李童                                                        #
#    修  改  :                                                                #
#    时  间  :    2015-01-13                                                  #
#    版  权  :    litong                                                      #
#    修  订  :                                                                #
#    时  间  :                                                                #
#    修  改  :    			                                                  #
#    说  明  :                                                                #
###############################################################################
#程序主目录
ETL_MAIN_PATH=$ETL_MAIN_PATH
unset LD_PRELOAD
#设置配置文件的路径
#当前时间
  curr_time1="`date +"%Y-%m-%d %H:%M:%S"`"
  curr_time2="`date +%Y%m%d%H%M%S`"
#####################################
#函数名：_Mesg
#功能描述：记录日志信息
#输入参数: Message
#返回值:0 成功 1 失败
#####################################
_Mesg()
{
    v_sTime=`date +"%Y%m%d %H:%M:%S"`

    if [ $# != 2 ]
    then
        echo "${v_sTime} $0 Error:   参数调用错误..."|tee -a $2
        return 1
    fi

    echo "${v_sTime} $0 Messages:  $1"|tee -a $2

    return 0
}
